backend/app/controllers/collects_controller.rb

  def index
    collects = Collect.all
---
SELECT "collects".* FROM "collects"

  def create
    collect = Collect.new(collect_params)

    if collect.save
---
INSERT INTO "collects" ("id", "collected_on", "ammount", "resident_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["id", 1], ["collected_on", "2027-02-15"], ["ammount", 10.1], ["resident_id", 22], ["created_at", "2024-03-17 21:58:16.706028"], ["updated_at", "2024-03-17 21:58:16.706028"]]

  def update
    collect = Collect.find(params[:id])

    if collect.update(collect_params)
---
SELECT "collects".* FROM "collects" WHERE "collects"."id" = ? LIMIT ?  [["id", 103336229485488617], ["LIMIT", 1]]
UPDATE "collects" SET "resident_id" = ?, "updated_at" = ? WHERE "collects"."id" = ?  [["resident_id", 1021807983446717952], ["updated_at", "2024-03-23 23:27:22.152550"], ["id", 103336229485488617]]

  def destroy
    collect = Collect.find(params[:id])

    if collect.destroy
---
SELECT "collects".* FROM "collects" WHERE "collects"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
DELETE FROM "collects" WHERE "collects"."id" = ?  [["id", 13]]