backend/app/controllers/currency_handouts_controller.rb

  def index
    @currency_handouts = CurrencyHandout.all
---
SELECT "currency_handouts".* FROM "currency_handouts"

  def create
    @currency_handout = CurrencyHandout.new(currency_handout_params)

    respond_to do |format|
      if @currency_handout.save
---
INSERT INTO "currency_handouts" ("id", "title", "start_date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["id", 445853565865678080], ["title", "entrega 1"], ["start_date", "2024-05-12"], ["created_at", "2024-05-12 20:52:28.206420"], ["updated_at", "2024-05-12 20:52:28.206420"]]

  def update
    respond_to do |format|
      if @currency_handout.update(currency_handout_params)
---
UPDATE "currency_handouts" SET "start_date" = ?, "updated_at" = ? WHERE "currency_handouts"."id" = ?  [["start_date", "2024-03-26"], ["updated_at", "2024-03-29 20:31:16.777793"], ["id", 57686599976835291]]

  def destroy
    @currency_handout.destroy
---
DELETE FROM "currency_handouts" WHERE "currency_handouts"."id" = ?  [["id", 1]]

    def set_currency_handout
      @currency_handout = CurrencyHandout.find(params[:id])
---
SELECT "currency_handouts".* FROM "currency_handouts" WHERE "currency_handouts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]