backend/app/controllers/receipts_controller.rb

  def index
    @receipts = Receipt.all
---
SELECT "receipts".* FROM "receipts"

  def create
    @receipt = Receipt.new(receipt_params)

    respond_to do |format|
      if @receipt.save
---
INSERT INTO "receipts" ("handout_date", "value", "resident_id", "currency_handout_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["handout_date", "2024-03-14"], ["value", 10.0], ["resident_id", 1], ["currency_handout_id", 1], ["created_at", "2024-03-18 15:26:57.857487"], ["updated_at", "2024-03-18 15:26:57.857487"]]

  def destroy
    @receipt.destroy
---
DELETE FROM "receipts" WHERE "receipts"."id" = ?  [["id", 1]]

    def set_receipt
      @receipt = Receipt.find(params[:id])
---
SELECT "receipts".* FROM "receipts" WHERE "receipts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]