backend/app/controllers/residents_controller.rb

SELECT "residents".* FROM "residents"
---
  def index
    residents = Resident.all

SELECT "residents".* FROM "residents" WHERE "residents"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    resident = Resident.find(params[:id])

INSERT INTO "residents" ("id", "name", "situation", "roka_id", "has_plaque", "registration_year", "address", "reference_point", "lives_in_JN", "phone", "is_on_whatsapp_group", "birthdate", "profession", "residents_in_the_house", "observations", "created_at", "updated_at", "needs_collect_on_the_house") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18) RETURNING "id"
---
  def create
    resident = Resident.new(resident_params)

    if resident.save

SELECT "residents".* FROM "residents" WHERE "residents"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "residents" SET "situation" = ?, "roka_id" = ?, "registration_year" = ?, "updated_at" = ? WHERE "residents"."id" = ?  [["situation", 0], ["roka_id", 3], ["registration_year", 1990], ["updated_at", "2024-02-19 23:00:28.716863"], ["id", 4]]
---
  def update
    resident = Resident.find(params[:id])

    if resident.update(resident_params)

SELECT "residents".* FROM "residents" WHERE "residents"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "residents" WHERE "residents"."id" = ?  [["id", 2]]
---
  def destroy
    resident = Resident.find(params[:id])

    puts resident.name

    if resident.destroy